// 报告,type = 1
export const REPORT_TASK = {
  '9018569255a5712da9fd527013808617': 1,  // 报告编制
  '3762426815a571302aa5736016931631': 2,  // 报告校验
  '1546753245a571352a35d67021131808': 3,  // 报告审核
  '3404235605a5713caa59782069577955': 4   // 报告批准
};
// 合同,type = 2
export const CONTRACT_TASK = {
  '4373963965a6fd9e6de3409040853830': 1,  // 生产经营部新建
  '7096257625a6fd9e6e327b7056575944': 2,  // 生产经营部合同核查
  '7591958415a6fda5eb32403071634539': 3,  // 检测部门经理详审
  '6555548895a7040fb4fa738001673444': 4,  // 副总经理详审核
  '2960155625a7131c20ab279093375177': 5,  // 总经理审核
  '6965696805a7131ea0dfde4035064095': 6   // 董事长批准
};
// 项目,type = 3
export const PROJECT_TASK = {
  '7982302615a72852c915309038918837': 1,  // 生产经营部新建
  '6846831325a7285cc7818a5005400886': 2,  // 检验部门审核项目
  '2803881535a7285f4734977045032333': 3   // 领导批准
};

export const TASK = [
  REPORT_TASK,
  CONTRACT_TASK,
  PROJECT_TASK
];
